ARTICLES = {
   "Как правильно готовиться ко сну: 10 полезных советов" : "https://telegra.ph/Kak-pravilno-gotovitsya-ko-snu-10-poleznyh-sovetov-06-16",
}

CHOICE, TIME_OF_WAKEUP, HOURS, ARTICLE, BUTTON = range(5)

wake_up_hour, wake_up_minute = 0, 0

HELLO_MESSAGE = """Привет! Я могу помочь тебе определить оптимальное 
время для засыпания и пробуждения. Выбери один из предложенных вариантов моих функций."""

TEXT_LIST_OF_ARTICLES = "Выберите из предложенного списка интересующую вас статью:"

GETTING_UP_TIME_TEXT = "Укажите желаемое время пробуждения в формате ЧЧ:ММ"

ERROR_TEXT_OF_TIME = "Извините, произошла ошибка."

GETTING_HOURS_OF_SLEEP_TEXT = "Отлично! Теперь укажите длительность сна, которую вы предпочитаете (в часах)."

ERROR_TEXT_AMOUNT_OF_HOURS = "Извините, произошла ошибка. Пожалуйста, укажите длительность сна, которую вы предпочитаете (в часах)."

TEXT_TIME_OF_WAKEUP = "Оптимальное время для отхода ко сну это"

BYE_TEXT = "Надеюсь, что я вам чем-то помог!"