ARTICLES = {
   "Как правильно готовиться ко сну: 10 полезных советов" : "https://telegra.ph/Kak-pravilno-gotovitsya-ko-snu-10-poleznyh-sovetov-06-16",
}

MAIN_MENU, CHOICE, TIME_OF_WAKEUP, HOURS, ARTICLE, BUTTON = range(6)

wake_up_hour, wake_up_minute = 0, 0

bedtime = 0

HELLO_MESSAGE = """Приветствую тебя, уважаемый пользователь! Я ZzzMaster — твой верный спутник в улучшении качества сна. Моя главная задача — помочь тебе найти оптимальное время для отхода ко сну и предоставить полезные советы, чтобы твои ночные приключения были приятными и освежающими.

Знаю, что когда речь идет о сне, каждый человек индивидуален. Поэтому я использую передовые алгоритмы и информацию, чтобы предложить тебе идеальное время для засыпания, учитывая твои предпочтения и особенности.

Но это не все! Я готов поделиться с тобой разнообразными советами, которые помогут улучшить твой сон. Независимо от того, нужно ли тебе расслабляющая рутина перед сном, мягкий свет в спальне или мелодии для умиротворения, я всегда буду рядом, чтобы помочь тебе создать идеальное окружение для отдыха.

Не забывай, что качественный сон — это важный фактор для твоего физического и психического благополучия. Я всегда готов помочь тебе достичь глубокого и восстанавливающего отдыха."""

MAIN_MENU_TEXT = "Выбери, с чем я могу тебе помочь:"

TEXT_LIST_OF_ARTICLES = "Выберите из предложенного списка интересующую вас статью:"

GETTING_UP_TIME_TEXT = "Укажите желаемое время пробуждения в формате ЧЧ:ММ"

ERROR_TEXT_OF_TIME = "Извините, произошла ошибка."

GETTING_HOURS_OF_SLEEP_TEXT = "Отлично! Теперь укажите длительность сна, которую вы предпочитаете (в часах)."

ERROR_TEXT_AMOUNT_OF_HOURS = "Извините, произошла ошибка. Пожалуйста, укажите длительность сна, которую вы предпочитаете (в часах)."

TEXT_TIME_OF_WAKEUP = "Оптимальное время для отхода ко сну это"

TEXT_REMAINDER = "Поставить напоминание для отхода ко сну?"

SUCCESS_REMAIND = "Напоминание успешно установлено на:"

BYE_TEXT = "Надеюсь, что я вам чем-то помог!"